twprintsstudio/SpaceMouse/sparkfun/avr/boards.txt
#############################
# SpaceMouse Pro Micro (5V, 16 MHz)
#############################
spacemouse.name=Thomas SpaceMouse Pro Micro

spacemouse.upload.tool=avrdude
spacemouse.upload.protocol=avr109
spacemouse.upload.maximum_size=28672
spacemouse.upload.maximum_data_size=2560
spacemouse.upload.speed=57600
spacemouse.upload.disable_flushing=true
spacemouse.upload.use_1200bps_touch=true
spacemouse.upload.wait_for_upload_port=true

spacemouse.bootloader.tool=avrdude
spacemouse.bootloader.low_fuses=0xff
spacemouse.bootloader.high_fuses=0xd8
spacemouse.bootloader.extended_fuses=0xcb
spacemouse.bootloader.file=caterina/Caterina-promicro16.hex
spacemouse.bootloader.unlock_bits=0x3F
spacemouse.bootloader.lock_bits=0x2F

spacemouse.build.mcu=atmega32u4
spacemouse.build.f_cpu=16000000L
spacemouse.build.vid=0x256F
spacemouse.build.pid=0xC631
spacemouse.build.usb_product="Thomas SpaceMouse Pro Micro"
spacemouse.build.board=AVR_PROMICRO
spacemouse.build.core=arduino
spacemouse.build.variant=promicro
spacemouse.build.extra_flags={build.usb_flags}
